content/20221231174339-principles_of_programming_class_notes.org
:PROPERTIES:
:ID:       a41030c6-f8ca-46bc-9041-0dc6e4f4b823
:END:
#+title: Principles of Programming - Class Notes
#+HTML_HEAD: <link rel="stylesheet" href="https://alves.world/org.css" type="text/css">
#+HTML_HEAD: <style type="text/css" media="print"> body { visibility: hidden; display: none } </style>
#+OPTIONS: toc:2
#+HTML_HEAD: <script src="https://alves.world/tracking.js" ></script>
#+HTML_HEAD: <script src="anti-cheat.js"></script>
#+HTML: <script data-name="BMC-Widget" data-cfasync="false" src="https://cdnjs.buymeacoffee.com/1.0.0/widget.prod.min.js" data-id="velocitatem24" data-description="Support me on Buy me a coffee!" data-message="" data-color="#5F7FFF" data-position="Right" data-x_margin="18" data-y_margin="18"></script>
#+HTML: <script>setTimeout(() => {alert("Finding this useful? Consider buying me a coffee! Bottom right cornner :) Takes just a few seconds")}, 60*1000);_paq.push(['trackEvent', 'Exposure', 'Exposed to beg']);</script>


*New* search feature! Make use of the amazing [[https://en.wikipedia.org/wiki/Approximate_string_matching][fuzzy search]] algorithm. Just type in the search box and it will find the closest match in the page. Hit =Enter= to jump to the next match. Lmk if it doesn't work for you.
#+HTML: <input id="search" type="text" placeholder="Search" /> <span id="resultCount"></span>
#+HTML: <script src="https://alves.world/fuzzy.js"></script>



You can download this file [[https://alves.world/university-notes-content/20221231174339-principles_of_programming_class_notes.org][here]]. Then open it in Pycharm, you will get the option to download the extension Org4Idea. Install it and restart Pycharm. Now you can open the file in Pycharm and you will see the file formatted much better.

* Data Types
** Integers
An integer is a whole number, positive or negative, with no fractional part.
In python integers are represented by the int class. The int class has the following methods:
- =__add__(self, other)__= : returns the sum of self and other
- =__sub__(self, other)__= : returns the difference of self and other
- =__mul__(self, other)__= : returns the product of self and other
- =__floordiv__(self, other)__= : returns the quotient of self and other
- =__mod__(self, other)__= : returns the remainder of self and other
- =__pow__(self, other)__= : returns the power of self and other
- =__abs__(self)__= : returns the absolute value of self
- =__neg__(self)__= : returns the negative value of self
- =__pos__(self)__= : returns the positive value of self


How do we use integers in python?
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
a = 5
b = 2
print(a.__add__(b))
print(a+b)
#+END_SRC

#+RESULTS:
: 7
: 7

** Floating Point Numbers
A floating point number is a number with a fractional part. In python floating point numbers are represented by the float class. The float class has the following methods:
- =__add__(self, other)__= : returns the sum of self and other
- =__sub__(self, other)__= : returns the difference of self and other
- =__mul__(self, other)__= : returns the product of self and other
- =__floordiv__(self, other)__= : returns the quotient of self and other
- =__mod__(self, other)__= : returns the remainder of self and other
- =__pow__(self, other)__= : returns the power of self and other
- =__abs__(self)__= : returns the absolute value of self
- =__neg__(self)__= : returns the negative value of self
- =__pos__(self)__= : returns the positive value of self

The difference between the int and float classes is that the float class has the following methods:
- =__truediv__(self, other)__= : returns the quotient of self and other
- =__round__(self, ndigits)__= : returns the rounded value of self to ndigits decimal places
- =__floor__(self)__= : returns the floor value of self
- =__ceil__(self)__= : returns the ceiling value of self

How do we use floating point numbers in python?
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  a = 5.0
  b = 2.0
  c = 2.5128596
  print(a.__truediv__(b))
  print(a/b)
  print(c.__round__(3))
#+END_SRC

#+RESULTS:
: 2.5
: 2.5
: 2.513

** Strings
A string is a sequence of characters. In python strings are represented by the str class. The str class has the following methods:
- =__add__(self, other)__= : returns the concatenation of self and other
- =__mul__(self, other)__= : returns the product of self and other
- =__len__(self)__= : returns the length of self
- =__getitem__(self, key)__= : returns the character at index key of self
- =__setitem__(self, key, value)__= : sets the character at index key of self to value
- =__delitem__(self, key)__= : deletes the character at index key of self
- =__contains__(self, item)__= : returns True if item is in self, False otherwise
- =__iter__(self)__= : returns an iterator over self
- =__reversed__(self)__= : returns a reversed iterator over self
- =__eq__(self, other)__= : returns True if self and other are equal, False otherwise
- =__ne__(self, other)__= : returns True if self and other are not equal, False otherwise
- =__lt__(self, other)__= : returns True if self is less than other, False otherwise
- =__le__(self, other)__= : returns True if self is less than or equal to other, False otherwise
- =__gt__(self, other)__= : returns True if self is greater than other, False otherwise
- =__ge__(self, other)__= : returns True if self is greater than or equal to other, False otherwise
- =__hash__(self)__= : returns the hash value of self
- =__str__(self)__= : returns the string representation of self
- =__repr__(self)__= : returns the string representation of self
- =__format__(self, format_spec)__= : returns the formatted string representation of self

How do we use strings in python? We can use single quotes or double quotes to represent strings.

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  a = 'Hello'
  b = "World"
  # here are some examples of string methods
  print(a.__add__(b))
  print(a.__hash__())
  print(a.__len__())
  print(a.__getitem__(1))
  print(b.__contains__('l'))
#+END_SRC

#+RESULTS:
: HelloWorld
: -705289849546263557
: 5
: e
: True

** Booleans
A boolean is a value that can be either True or False. In python booleans are represented by the bool class. The bool class has the following methods:
- =__and__(self, other)__= : returns the logical and of self and other
- =__or__(self, other)__= : returns the logical or of self and other
- =__xor__(self, other)__= : returns the logical xor of self and other
- =__eq__(self, other)__= : returns True if self and other are equal, False otherwise
- =__ne__(self, other)__= : returns True if self and other are not equal, False otherwise
- =__hash__(self)__= : returns the hash value of self
- =__str__(self)__= : returns the string representation of self
- =__repr__(self)__= : returns the string representation of self

How do we use booleans in python?
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  a = True
  b = False
  print(a.__and__(b))
  print(a.__or__(b))
  print(a.__xor__(b))
  print(a.__hash__())
#+END_SRC

#+RESULTS:
: False
: True
: True
: 1

Another way we can use booleans in python is by using the following operators:
- =and= : returns the logical and of two values
- =or= : returns the logical or of two values
- =not= : returns the logical not of a value

Examples:
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  a = True
  b = False
  print(a and b)
  print(a or b)
  print(not a)
#+END_SRC

#+RESULTS:
: False
: True
: False


We will also introduce more in coming sections.
* Flow Control Statements
** Conditional Statements
Conditional statements are used to control the flow of execution of a program. In python conditional statements are represented by the if, elif, and else statements. The syntax of the if statement is as follows:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  if condition:
    # do something
    print('Hello')
#+END_SRC

If we need to use multiple conditions we can use the elif statement. The syntax of the elif statement is as follows:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  if condition1:
    # do something
    print('Hello')
  elif condition2:
    # do something
    print('World')
#+END_SRC

If none of the conditions are met we can use the else statement. The syntax of the else statement is as follows:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  if condition1:
    # do something
    print('Hello')
  elif condition2:
    # do something
    print('World')
  else:
    # do something
    print('!')
#+END_SRC

