content/20221231174339-principles_of_programming_class_notes.org
** Loops
Loops are used to repeat a block of code. In python loops are represented by the for and while statements. The syntax of the for statement is as follows:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  for i in range(10):
    # do something
    print(i)
#+END_SRC

We can also make looks more interesting by using the following syntax:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  someList = [x for x in range(10)]
  print(someList)
#+END_SRC

#+RESULTS:
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

We call this a list comprehension. We can also use list comprehensions to create lists of lists. The general syntax of a list comprehension is as follows:

=[[expression] for item in iterable if condition]=


*** While
The syntax of the while statement is as follows:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  i = 0
  while i < 10:
    # do something
    print(i)
    i += 1
#+END_SRC

** Break and Continue
The break statement is used to exit a loop. The continue statement is used to skip the current iteration of a loop. The syntax of the break statement is as follows:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  for i in range(10):
    if i == 5:
      break
    print(i)
#+END_SRC

#+RESULTS:
: 0
: 1
: 2
: 3
: 4


The syntax of the continue statement is as follows:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  for i in range(10):
    if i == 5:
      continue
    print(i)
#+END_SRC

#+RESULTS:
: 0
: 1
: 2
: 3
: 4
: 6
: 7
: 8
: 9

We can see that the number 5 is not printed because we used the continue statement to skip the current iteration of the loop.

* Logic
** Truth Value Testing
In python we can test the truth value of an object. The following values are considered false:
- =None=
- =False=
- =zero of any numeric type=
- =any empty sequence, for example, '', (), []=
- =any empty mapping, for example, {}=

All other values are considered true. For example:
- =True=
- =non-zero numbers=
- =non-empty strings=
- =non-empty lists=
- =non-empty tuples=
- =non-empty dictionaries=

We can use the following functions to test the truth value of an object:
- =bool()= : returns the truth value of an object
- =all()= : returns True if all elements of an iterable are true (or if the iterable is empty)
- =any()= : returns True if any element of an iterable is true. If the iterable is empty, returns False




** Identity Operators
The identity operators are used to compare the memory locations of two objects. The identity operators are:

- =is= : returns True if the operands are identical (refer to the same object)
- =is not= : returns True if the operands are not identical (do not refer to the same object)

Examples:
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  a = 5
  b = 5
  print(a is b)
  print(a is not b)
#+END_SRC

#+RESULTS:
: True
: False

** Membership Operators
The membership operators are used to test whether a value or variable is found in a sequence. The membership operators are:

- =in= : returns True if a sequence with the specified value is present in the object
- =not in= : returns True if a sequence with the specified value is not present in the object

Examples:
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  a = [1, 2, 3, 4, 5]
  print(1 in a)
  print(6 in a)
  print(1 not in a)
  print(6 not in a)
#+END_SRC

#+RESULTS:
: True
: False
: False
: True

** Bitwise Operators
Bitwise operators are used to compare (binary) numbers. The bitwise operators are:

- =&= : binary and
- =|= : binary or
- =~= : binary xor
- =~= : binary ones complement
- =<<= : binary left shift
- =>>= : binary right shift

Examples:
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  a = 60
  b = 13
  print(a & b)
  print(a | b)
  print(a ^ b)
  print(~a)
  print(a << 2)
  print(a >> 2)
#+END_SRC

#+RESULTS:
: 12
: 61
: 49
: -61
: 240
: 15

We probably won't use bitwise operators very often, but it's good to know they exist.


* Scope and Constants
** Scope
Scope, is the area of a program where an object or name may be accessible. In python there are two types of scope:
- =global= : a name that is defined outside of a function
- =local= : a name that is defined inside a function

We can access a global variable inside a function by using the =global= keyword. The syntax of the =global= keyword is as follows: =global variableName=. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  a = 5
  def myFunction():
    global a
    a = 10
    print(a)
  myFunction()
  print(a)

#+END_SRC

#+RESULTS:
: 10
: 10

** Constants
Constants are variables whose value cannot be changed. In python constants are usually defined in all capital letters. For example: =PI=, =E=, =G=.

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  PI = 3.14
  E = 2.71
  G = 9.81
  print(PI)
  print(E)
  print(G)
#+END_SRC

#+RESULTS:
: 3.14
: 2.71
: 9.81

What if we try to modify a constant? Let's try it:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  PI = 3.14
  PI = 3.15
  print(PI)
#+END_SRC

#+RESULTS:
: 3.15

We can see that we can modify a constant. This is because python does not have a constant type. We can use the =const= module to define constants. Python uses constants more as a semantic convention than a language feature. The =const= module is not part of the standard library, so we need to install it. We can install the =const= module using the =pip= command:

* Functions
A function is a block of code which only runs when it is called. You can pass data, known as parameters, into a function. A function can return data as a result. In python a function is defined using the =def= keyword. The syntax of a function is as follows:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  def myFunction():
    print("Hello World")
#+END_SRC

#+RESULTS:

We can call the function by using the function name followed by parenthesis. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myFunction()
#+END_SRC

#+RESULTS:
: Hello World

** Arguments
Information can be passed into functions as arguments. Arguments are specified after the function name, inside the parentheses. You can add as many arguments as you want, just separate them with a comma. The following example has a function with one argument ( =name= ). When the function is called, we pass along a first name, which is used inside the function to print the full name:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  def myFunction(name):
    print(name + " Smith")
  myFunction("John")
  myFunction("Jane")
  myFunction("Joe")
#+END_SRC

#+RESULTS:
: John Smith
: Jane Smith
: Joe Smith

We can also use default arguments. Default arguments are used when we call the function without arguments. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  def myFunction(name = "John"):
    print(name + " Smith")
  myFunction()
  myFunction("Jane")
  myFunction("Joe")
#+END_SRC

#+RESULTS:
: John Smith
: Jane Smith
: Joe Smith

These might also be called optional arguments.
** Return Types
To let a function return a value, use the =return= statement:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  def myFunction(x):
    return 5 * x
  print(myFunction(3))
  print(myFunction(5))
  print(myFunction(9))
#+END_SRC

#+RESULTS:
: 15
: 25
: 45

That is not the only way to get some data from a function, we can make use of =yield= statements. The =yield= statement is used to define a generator, which is covered in the next sections.

