content/20221231174339-principles_of_programming_class_notes.org
** Recursion
Python also accepts function recursion, which means a defined function can call itself. Recursion is a common mathematical and programming concept. It means that a function calls itself. This has the benefit of meaning that you can loop through data to reach a result.
The developer should be very careful with recursion as it can be quite easy to slip into writing a function which never terminates, or one that uses excess amounts of memory or processor power. However, when written correctly recursion can be a very efficient and mathematically-elegant approach to programming.

Example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  def fib(n):
    if n <= 1:
      return n
    else:
      return(fib(n-1) + fib(n-2))
  print(fib(7))
#+END_SRC

Be careful, python has a default recursion limit of 1000. If you need to increase the recursion limit, you can use the =sys.setrecursionlimit()= method. But this probably means you are doing something wrong.
* Lists
Probably the best datatype in python is the =list=. A list is a collection which is ordered and changeable. In python lists are written with square brackets. For example: =myList = [1, 2, 3]=. We can access the items of a list by referring to the index number. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myList = ["apple", "banana", "cherry"]
  print(myList[1])
#+END_SRC

#+RESULTS:
: banana

We can also use negative indexing. Negative indexing means beginning from the end, -1 refers to the last item, -2 refers to the second last item etc. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myList = ["apple", "banana", "cherry"]
  print(myList[-1])
#+END_SRC

#+RESULTS:
: cherry

Some important list methods are:
- =append()= : adds an element at the end of the list
- =clear()= : removes all the elements from the list
- =copy()= : returns a copy of the list
- =count()= : returns the number of elements with the specified value. Ex: =myList.count("apple")=
- =extend()= : add the elements of a list (or any iterable), to the end of the current list. Ex: =myList.extend(myList2)=
- =index()= : returns the index of the first element with the specified value
- =insert()= : adds an element at the specified position. Ex: =myList.insert(2, "orange")=
- =pop()= : removes the element at the specified position. This also returns the removed element. Ex: =myList.pop(1)=
- =remove()= : removes the first item with the specified value. Ex: =myList.remove("banana")=
- =reverse()= : reverses the order of the list
- =sort()= : sorts the list

** List Comprehension
This is really what makes python so powerful. List comprehension is an elegant way to define and create lists based on existing lists. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myList = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
  newList = [x for x in myList if x % 2 == 0]
  print(newList)
#+END_SRC

#+RESULTS:
: [2, 4, 6, 8, 10]

This, is frankly amazing. We can also use =if= and =else= statements in list comprehension.

Here is an example of bad 'non-pythonic' code and how we can make it better using list comprehension:

**** Example
Bad code:
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myList = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
  newList = []
  for x in myList:
    if x % 2 == 0:
      newList.append(x)
  print(newList)
#+END_SRC

#+RESULTS:
: [2, 4, 6, 8, 10]

Good Code:
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myList = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
  newList = [x for x in myList if x % 2 == 0]
  print(newList)
#+END_SRC

#+RESULTS:
: [2, 4, 6, 8, 10]

**** Example 2
Bad code:
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  import random
  random.seed(1)
  myList = []
  for i in range(10):
    myList.append(random.randint(1, 100))
  print(myList)
#+END_SRC

#+RESULTS:
: [18, 73, 98, 9, 33, 16, 64, 98, 58, 61]

Good code:
#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  import random
  random.seed(1)
  myList = [random.randint(1, 100) for i in range(10)]
  print(myList)
#+END_SRC

#+RESULTS:
: [18, 73, 98, 9, 33, 16, 64, 98, 58, 61]

* Tuples
A tuple is a collection which is ordered and unchangeable. In python tuples are written with round brackets. For example: =myTuple = (1, 2, 3)=. We can access the items of a tuple by referring to the index number. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myTuple = ("apple", "banana", "cherry")
  print(myTuple[1])
#+END_SRC

#+RESULTS:
: banana

It is somewhat like a list but immutable (cannot be changed). We can also use negative indexing. A very common way of using tuples is to return multiple values from a function. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  def myFunction():
    return (1, 2, 3)
  print(myFunction())
#+END_SRC

* Spread Syntax
Spread syntax is a very powerful way of unpacking iterables. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myList = [1, 2, 3, 4, 5]
  print(*myList)
#+END_SRC

#+RESULTS:
: 1 2 3 4 5

Why is this useful? Well, we can use this to unpack a list into a function. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  def myFunction(a, b, c, d, e):
    print(a, b, c, d, e)
  myList = [1, 2, 3, 4, 5]
  myFunction(*myList)
#+END_SRC

#+RESULTS:
: 1 2 3 4 5

** Dictionaries
We can step this up a notch by applying it to dicionaries. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myDict = {"a": 1, "b": 2, "c": 3, "d": 4, "e": 5}
  print(*myDict)
#+END_SRC

#+RESULTS:
: a b c d e

This will print the keys of the dictionary. We can also use the =**= operator to unpack the values of the dictionary. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myDict = {"a": 1, "b": 2, "c": 3, "d": 4, "e": 5}
  def myFunction(a, b, c, d, e):
    print(a, b, c, d, e)
  myFunction(**myDict)
#+END_SRC

#+RESULTS:
: 1 2 3 4 5


* Files
We can open a file using the =open()= function. The =open()= function takes two parameters; filename, and mode. There are four different methods (modes) for opening a file:

- =r= : Read - Default value. Opens a file for reading, error if the file does not exist
- =a= : Append - Opens a file for appending, creates the file if it does not exist
- =w= : Write - Opens a file for writing, creates the file if it does not exist
- =x= : Create - Creates the specified file, returns an error if the file exists

Here is an example of how to open a file:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myFile = open("myfile.txt")
  print(myFile.read())
#+END_SRC

#+RESULTS:
: some data

The best practice is to use the =with= keyword when dealing with file objects. This has the advantage that the file is properly closed after its suite finishes, even if an exception is raised at some point.

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  with open("myfile.txt") as myFile:
    print(myFile.read())
#+END_SRC

#+RESULTS:
: some data

Key methods for file objects:
- =read()= : reads the entire file
- =readline()= : reads a single line
- =readlines()= : reads all the lines into a list
- =write()= : writes to the file
- =close()= : closes the file


** Writing to a file
How do we write to a file? We can use the =write()= method. For example:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  with open("myfile.txt", "w") as myFile:
    myFile.write("\nsome data")
#+END_SRC

