content/20221231174339-principles_of_programming_class_notes.org
* GUI
We use the =graphics.py= library to create a GUI. We can create a window, draw shapes, and add text. You can find the documentation for the library [[./graphics.pdf][here]]. Here is some key documentation for the library:

- =GraphWin(title, width, height)= : creates a window
- =Point(x, y)= : creates a point.
- =Circle(center, radius)= : creates a circle, the center is a point.
- =Rectangle(p1, p2)= : creates a rectangle. The points are the top left and bottom right corners, both are points.
- =Line(p1, p2)= : creates a line. The points are the start and end points, both are points.
- =Text(p, text)= : creates text. The point is the top left corner of the text.

Some key methods for the objects.
- =.draw(win)= : draws the shape on the window. This is a method for all shapes.
- =.setFill(color)= : sets the fill color of the shape. This is a method for all shapes.
- =.setOutline(color)= : sets the outline color of the shape. This is a method for all shapes.
- =.setText(text)= : sets the text of the text object. This is a method for the text object.
- =.setFace(face)= : sets the face of the text object. This is a method for the text object.

Methods for the window:
- =.getMouse()= : waits for a mouse click and returns the point where the mouse was clicked.
- =.getKey()= : waits for a key press and returns the key that was pressed.
- =.close()= : closes the window.

Here is an example of how to create a window and draw a circle:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  from graphics import *
  win = GraphWin("My Window", 500, 500)
  circle = Circle(Point(250, 250), 50)
  circle.draw(win)
  win.getMouse()
  win.close()
#+END_SRC
* OOP
OOP might shake things up a bit, but it only makes things easier in the end. We can create classes and objects. We can also create methods and attributes. Here is an example of how to create a class:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  class MyClass:
    def __init__(self, name):
      self.name = name
    def myMethod(self):
      print("Hello, my name is " + self.name)
  myObject = MyClass("John")
  myObject.myMethod()
#+END_SRC

Might look intimidating at first, but it's not that bad. Let's break it down. Classes have a very specific syntax. We start with the =class= keyword, followed by the name of the class. We then have a colon.

The body of the class is where we define the methods and attributes of the class. We can define methods using the =def= keyword. Each method must have the =self= parameter. The =self= parameter is a reference to the current instance of the class, and is used to access variables that belong to the class.

It is important to now the methods with a =__= prefix. These are special methods. The =__init__= method is a constructor, which is called when the class is being initiated. The =__init__= method is called automatically every time the class is being used to create a new object. Other methods:
- =__del__= : destructor, called when the object is about to be destroyed
- =__repr__= : returns a string representation of the object
- =__str__= : returns a string representation of the object
- =__add__= : defines behavior for the + operator
- =__sub__= : defines behavior for the - operator
- =__mul__= : defines behavior for the * operator
- =__truediv__= : defines behavior for the / operator
- =__mod__= : defines behavior for the % operator
- =__lt__= : defines behavior for the < operator
- =__le__= : defines behavior for the <= operator
- =__eq__= : defines behavior for the == operator
- =__ne__= : defines behavior for the != operator
- =__gt__= : defines behavior for the > operator
- =__ge__= : defines behavior for the >= operator

With these methods, we can make life easier by defining them for our object, so that when we want to add two objects, we can just use the + operator, instead of having to define a method for it.

** Inheritance
Inheritance is a way to form new classes using classes that have already been defined. The newly formed classes are called derived classes, the classes that we derive from are called base classes. Important terminology:
- =Superclass= : a class from which we derive from
- =Subclass= : a class that we derive from another class

The benefits of inheritance are:
+ It represents real-world relationships well
+ It provides reusability of a code
+ It allows us to add more features to a class without modifying it

Here is an example of how to create a subclass:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  class Person:
    def __init__(self, name, age):
      self.name = name
      self.age = age
    def myMethod(self):
      print("Hello, my name is " + self.name)
  class Student(Person):
    def __init__(self, name, age, grade):
      Person.__init__(self, name, age)
      self.grade = grade
    def myMethod(self):
      print("Hello, my name is " + self.name + " and I am in grade " + str(self.grade))
  myObject = Student("John", 36, 10)
  myObject.myMethod()
#+END_SRC

#+RESULTS:
: Hello, my name is John and I am in grade 10


* Dictionaries
Dictionaries are used to store data values in =key:value= pairs. A dictionary is a collection which is ordered, changeable and does not allow duplicates. Dictionaries are written with curly brackets, and have keys and values:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  myDict = {
    "brand": "Ford",
    "model": "Mustang",
    "year": 1964
  }
  print(myDict)
#+END_SRC

#+RESULTS:
: {'brand': 'Ford', 'model': 'Mustang', 'year': 1964}

We can access the items of a dictionary by referring to its key name, inside square brackets:

#+BEGIN_SRC python :results output :exports both :session *Python* :eval yes
  x = myDict["model"]
  print(x)
#+END_SRC

#+RESULTS:
: Mustang

Some important methods for dictionaries:
- =.clear()= : removes all the elements from the dictionary
- =.copy()= : returns a copy of the dictionary
- =.fromkeys()= : returns a dictionary with the specified keys and values
- =.get()= : returns the value of the specified key
- =.items()= : returns a list containing a tuple for each key value pair
- =.keys()= : returns a list containing the dictionary's keys
- =.pop()= : removes the element with the specified key
- =.popitem()= : removes the last inserted key-value pair
- =.setdefault()= : returns the value of the specified key. If the key does not exist: insert the key, with the specified value
- =.update()= : updates the dictionary with the specified key-value pairs
- =.values()= : returns a list of all the values in the dictionary

#+HTML: <footer style="height: 20vh;"></footer>
